Python 3.6.3 (v3.6.3:2c5fed8, Oct  3 2017, 17:26:49) [MSC v.1900 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> dict=dict.fromkeys(range(66),'赞')
>>> dict
{0: '赞', 1: '赞', 2: '赞', 3: '赞', 4: '赞', 5: '赞', 6: '赞', 7: '赞', 8: '赞', 9: '赞', 10: '赞', 11: '赞', 12: '赞', 13: '赞', 14: '赞', 15: '赞', 16: '赞', 17: '赞', 18: '赞', 19: '赞', 20: '赞', 21: '赞', 22: '赞', 23: '赞', 24: '赞', 25: '赞', 26: '赞', 27: '赞', 28: '赞', 29: '赞', 30: '赞', 31: '赞', 32: '赞', 33: '赞', 34: '赞', 35: '赞', 36: '赞', 37: '赞', 38: '赞', 39: '赞', 40: '赞', 41: '赞', 42: '赞', 43: '赞', 44: '赞', 45: '赞', 46: '赞', 47: '赞', 48: '赞', 49: '赞', 50: '赞', 51: '赞', 52: '赞', 53: '赞', 54: '赞', 55: '赞', 56: '赞', 57: '赞', 58: '赞', 59: '赞', 60: '赞', 61: '赞', 62: '赞', 63: '赞', 64: '赞', 65: '赞'}
>>> for eachkey in dict.keys():
	print(eachkey)

	
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
>>> for eachvalue in dict.values():
	print(eachvalue)

	
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
赞
>>> for eachitem in dict.items():
	print(eachitem)

	
(0, '赞')
(1, '赞')
(2, '赞')
(3, '赞')
(4, '赞')
(5, '赞')
(6, '赞')
(7, '赞')
(8, '赞')
(9, '赞')
(10, '赞')
(11, '赞')
(12, '赞')
(13, '赞')
(14, '赞')
(15, '赞')
(16, '赞')
(17, '赞')
(18, '赞')
(19, '赞')
(20, '赞')
(21, '赞')
(22, '赞')
(23, '赞')
(24, '赞')
(25, '赞')
(26, '赞')
(27, '赞')
(28, '赞')
(29, '赞')
(30, '赞')
(31, '赞')
(32, '赞')
(33, '赞')
(34, '赞')
(35, '赞')
(36, '赞')
(37, '赞')
(38, '赞')
(39, '赞')
(40, '赞')
(41, '赞')
(42, '赞')
(43, '赞')
(44, '赞')
(45, '赞')
(46, '赞')
(47, '赞')
(48, '赞')
(49, '赞')
(50, '赞')
(51, '赞')
(52, '赞')
(53, '赞')
(54, '赞')
(55, '赞')
(56, '赞')
(57, '赞')
(58, '赞')
(59, '赞')
(60, '赞')
(61, '赞')
(62, '赞')
(63, '赞')
(64, '赞')
(65, '赞')
>>> print(dict[65])
赞
>>> print(dict[66])
Traceback (most recent call last):
  File "<pyshell#12>", line 1, in <module>
    print(dict[66])
KeyError: 66
>>> dict.get(32,'木有')
'赞'
>>> dict.get(36,'木有')
'赞'
>>> dict.get(66,'木有')
'木有'
>>> print(dict[66])
Traceback (most recent call last):
  File "<pyshell#16>", line 1, in <module>
    print(dict[66])
KeyError: 66
>>> dict.clear()
>>> dict
{}
>>> 
